// lab3project.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <fstream>
using namespace std;


int getRandomNumber(int min, int max)
{
	static const double fraction = 1.0 / (static_cast<double>(RAND_MAX) + 1.0);
	// Равномерно распределяем рандомное число в нашем диапазоне
	return static_cast<int>(rand() * fraction * (max - min + 1) + min);
}

int main()
{
	double ppr;
	double ppl;
	double K;
	double po;
	double H;
	double g;
	double pgr;
	double br;
	int i;
	g = 9.8;
	K = 0.25;
	i = 0;
	while (i < 160)
	{i++;
	H = getRandomNumber(0, 25)*0.1;//глубина в КМ
	po = 0.01 * (getRandomNumber(14, 18));// плотность раствора в г/см3
	br = po * g * H;// давление, создаваемое буровым раствором в стволе скважины в МПа/м
	ppr = 0.1 * (getRandomNumber(10, 23));//давление вышележащих пород в МПа/м
	ppl = 0.1 * (getRandomNumber(10, 23));//пластовое давление в МПа/м
	pgr = (ppr - ppl) * (K / (1 - K)) + ppl;// уравнение давления гидроразрыва метод Б.А. Итона
	if (br > pgr) // условие явления гидроразрыва
	/*	cout << pgr << endl,
		cout << br << endl,*/
		cout << ppr << endl,
		cout << ppl << endl,
		cout << po << endl,
		cout << H << endl,
	cout << endl;
	}
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
